//* Problem 01:
// =============
// একটি নতুন সিনেমা হলের জন্য একটি সিট প্ল্যানার তৈরি করতে হবে এই সিনেমা হলে সিটগুলো এমনভাবে ডিজাইন করা হয়েছে যে, যদি সিট নাম্বার ৩ বা ৫ ধারা বিভাজ্য হয় এবং কোন ভাগশেষ না হয় তাহলে সেটা  'প্রিমিয়াম' সিট হিসেবে গন্য হবে। অর্থাৎ, সিট নং যদি ১ হয় তাহলে সেটা হবে নরমাল সিট, যদি সিট নাম্বার হয় ৩/৫ তাহলে সেটা হবে প্রিমিয়াম সিট

// Problem: আপনার কাজ হলো একটি প্রোগ্রাম তৈরি করা, যা মোট সিট সংখ্যা (totalRows) নেবে এবং প্রতিটি সিট জন্য এটি 'নরমাল সিট' (Normal Row) নাকি 'প্রিমিয়াম সিট' (Premium Row) তা প্রিন্ট করবে। Row 1 - Normal Row, Row 4 - Premium Row

// ADVANCED: যদি সিট নরমাল হয় তাহলে প্রাইজ হবে ৫০০ টাকা আর যদি প্রিমিয়াম সিট হয় তাহলে প্রাইজ হবে ৮০০ টাকা। আপনাকে ক্যালকুলেট করে বের করতে হবে এক শোতে মোট কত টাকা আয় হবে উদাঃ Total Income: 5000 Taka

let totalRows = 55;
let total = 0;

for (let i = 0; i < totalRows; i++) {
  if (i % 3 === 0) {
    console.log("Premium Row", i);
    total += 800;
  } else if (i % 5 === 0) {
    console.log("Premium Row", i);
    total += 800;
  } else {
    console.log("Normal Row", i);
    total += 500;
  }
}

console.log("Total Income", total);
